In [3]:
import pandas as pd

In [33]:
data = [{'name': 'John', 'age': 30, 'city':'Taipei'},
        {'name': 'Mary', 'age': 25, 'city':'Taichung'},
        {'name': 'Ken', 'age': 35, 'city':'Kaohsiung'}]
df = pd.DataFrame(data)
df

   name  age       city
0  John   30     Taipei
1  Mary   25   Taichung
2   Ken   35  Kaohsiung

DataFrame.drop(labels=None, *, axis=0, index=None, columns=None, level=None, inplace=False, errors='raise')

In [34]:
df.drop(1)

   name  age       city
0  John   30     Taipei
2   Ken   35  Kaohsiung

In [ ]:
# df.drop(index=[0, 2])
df.drop([0, 2])

   name  age      city
1  Mary   25  Taichung

In [9]:
df.drop([0, 2, 1])

Empty DataFrame
Columns: [name, age, city]
Index: []

In [22]:
df.drop(index=[1, 2])

   name  age    city
0  John   30  Taipei

In [ ]:
# df.drop(columns=['city'])
df.drop('city', axis=1)

   name  age
0  John   30
1  Mary   25
2   Ken   35